# Pandas: Práctica

## Objetivos

* Crear objetos de tipo `Series` y `DataFrame` a partir de datos de Python. 
* Crear objetos de tipo `DataFrame` a partir de archivos.
* Indexar y cortar objetos con `pandas`.
* Agregar datos en el `DataFrame`s.
* Unir múltiples objetos de tipo `DataFrame`.

## ¿Qué es Pandas?

Una biblioteca de Python que proporciona estructuras de datos y herramientas de análisis de datos para datos tabulares de muchos tipos. Piensa en un `DataFrame` como una tabla en SQL. 

Usaremos esto prácticamente todos los días de aquí en adelante. Así que asegúrate de completar la tarea, e incluso hacerla de nuevo si no te sientes cómodo.

## Beneficios

  * Almacenamiento y procesamiento eficiente de los datos.
  * Incluye muchas funciones incorporadas para la transformación de datos, agregaciones y gráficos.
  * Excelente para el trabajo exploratorio.

## No tan buenas

  * No se adapta muy bien a conjuntos de datos muy grandes.

## Documentación:

Documentación de pandas:

  * http://pandas.pydata.org/pandas-docs/stable/index.html
  
  
Cheatsheet de utilidad:

  * https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf


Lectura extra:


  * [Indexing and Selecting](https://pandas.pydata.org/pandas-docs/stable/indexing.html)
  * [Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-mi-slicers)
  * [Group-by](https://pandas.pydata.org/pandas-docs/stable/groupby.html)

## Imports

In [1]:
%matplotlib inline

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

plt.style.use('ggplot')

## Numpy

`pandas` se construye a partir de los tipos de datos de `numpy` una biblioteca de nivel inferior.

El objeto básico de `numpy` es un `array`.

In [2]:
x = np.array([0, 1, 2, 3, 4, 5])
x

array([0, 1, 2, 3, 4, 5])

Los arrays cuentan con operaciones muy útiles.

In [3]:
x.sum()  # <-- Suma de números

15

Los arrays pueden ser multidimensionales. Un array **bidimensional** es una matriz.

In [4]:
M = np.array([
    [0, 1, 2],
    [1, 2, 3],
    [2, 3, 4],
    [5, 6, 7]
])

M

array([[0, 1, 2],
       [1, 2, 3],
       [2, 3, 4],
       [5, 6, 7]])

In [5]:
print(x.shape)
print(M.shape)

(6,)
(4, 3)

## Serie

In [6]:
heights = np.array([34, 35, 36, 37, 38])
student_heights = pd.Series(heights)
student_heights

0    34
1    35
2    36
3    37
4    38
dtype: int32

Para acceder al array debe ser a través de '.values'.

In [7]:
student_heights.values

array([34, 35, 36, 37, 38])

Losnúmeros '0,1,2,3,4' son el índice por defecto. 

Se puede acceder al índice a través de '.index'

In [8]:
student_heights.index

RangeIndex(start=0, stop=5, step=1)

El índice es un [iterable](https://www.programiz.com/python-programming/iterator).

In [9]:
type(student_heights.index)

pandas.core.indexes.range.RangeIndex

In [10]:
list(student_heights.index)

[0, 1, 2, 3, 4]

Es posible cambiar el índice manualmente

In [11]:
student_heights.index = ["Tomas", "Angel", "Stacy", "Michaela", "Haden"]

In [12]:
student_heights

Tomas       34
Angel       35
Stacy       36
Michaela    37
Haden       38
dtype: int32

Ahora es posible utilizar palabras para acceder a los ítems de la Serie.

In [13]:
student_heights['Michaela']

37

También se puede acceder a un ítem por su orden.

In [14]:
student_heights[2]

36

Utilizar métodos de numpy.

In [15]:
student_heights.mean()

36.0

Se pueden ver los parámetros de una función escribiendo
```python
pd.Series()
```
colocando el cursor dentro del paréntesis y presionando 'shift+tab'.

In [17]:
#Código:
pd.Series()

### 1.- Cuáles son los parámetros de pd.Series()?

In [ ]:
#Código:

#data,index,dtype,name,copy,fastpath

> POR FAVOR, NUNCA JAMÁS COPIE Y PEGUE MIENTRAS HACE ESTAS PREGUNTAS. No aprenderás a codificar de memoria. Y en tres semanas te darás cuenta de que no lo sabes. Lo hemos visto una y otra vez. Vale la pena. Abre una segunda ventana si necesitas copiar código.

> Para las variables que has definido o cargado utiliza el 'tabulador'. Por ejemplo:
>
>
> Abajo escribe 'bra' + tabulador y observa cómo se rellena el resto. Puede ser difícil de recordar, pero realmente ayuda.


## 2.- Hacer una serie 'brag_vow' con índice 'i am a numpy champ'. And values 'So Pandas here I come".

```python 

print(brag_vow)

I            So
am       Pandas
a          here
numpy         I
champ      come
dtype: object
```

In [21]:
#Código:

brag_vow = pd.Series(data=['So','Pandas','here','I','come'],index=["I","am","a","numpy","champ"]);
brag_vow

I            So
am       Pandas
a          here
numpy         I
champ      come
dtype: object

### 3.- Imprimir los últimos tres elementos de 'brag_vow'

```python 
a          here
numpy         I
champ      come
dtype: object
```

In [27]:
#Código:
print(brag_vow.tail(3));

a        here
numpy       I
champ    come
dtype: object

### 4.- Imprimir los elementos relacionados al index 'I a champ' (No utilizar índice numérico)

```python 
I          So
a        here
champ    come
dtype: object
```

In [37]:
#Código:
print(brag_vow.loc[["I","a","champ"]]);

I          So
a        here
champ    come
dtype: object

### 5.- De "student_heights", imprimir los estudiantes cuya estatura es un numero par por medio de un índice booleano.

```python 
Tomas    34
Stacy    36
Haden    38
dtype: int64
```

In [42]:
#Código:
print(student_heights.loc[student_heights.values % 2 == 0]);

Tomas    34
Stacy    36
Haden    38
dtype: int32

### 6.- Imprimir los valores de brag_vow:

```python 
array(['So', 'Pandas', 'here', 'I', 'come'], dtype=object)
```

In [324]:
#Código:

brag_vow.values

array(['So', 'Pandas', 'here', 'I', 'come'], dtype=object)

### 7.- Imprimir el index de brag_vow:

```python 
Index(['I', 'am', 'a', 'numpy', 'champ'], dtype='object')
```

In [44]:
#Código:

print(brag_vow.index);

Index(['I', 'am', 'a', 'numpy', 'champ'], dtype='object')

# Nombre de una Serie

Las Series pueden tener un nombre

In [47]:
student_grades = pd.Series([45,56,78,89,90], 
                           index=['Tomas', 'Angel', 'Stacy', 'Michaela', 'Haden'], 
                           name='grades')

In [48]:
student_grades

Tomas       45
Angel       56
Stacy       78
Michaela    89
Haden       90
Name: grades, dtype: int64

Observe el Name:

### Crear Dataframes a partir de objetos

Tenemos dos series: student_heights y student_grades. Cada una tiene los mismos estudiantes en el índice. ¿No sería genial si pudiéramos acceder a todos los datos de los estudiantes a la vez?

Para ello, utilizaremos un dataframe.

In [49]:
students = pd.DataFrame({'grade':student_grades, 'height':student_heights})
students

          grade  height
Tomas        45      34
Angel        56      35
Stacy        78      36
Michaela     89      37
Haden        90      38

Hay al menos dos maneras de pensar en un dataframe.

Una es como una serie múltiple con índice coincidente. La otra es como un array de numpy con columnas y filas explícitamente etiquetadas.

La verdad es que un dataframe es AMBAS.

In [50]:
# numpy array:
students.values

array([[45, 34],
       [56, 35],
       [78, 36],
       [89, 37],
       [90, 38]], dtype=int64)

In [51]:
# pandas series:
students['grade']

Tomas       45
Angel       56
Stacy       78
Michaela    89
Haden       90
Name: grade, dtype: int64

También podemos crear DataFrames a partir de arrays de numpy o listas con etiquetas e índices proporcionados. El parámetro `columns=` especifica los nombres de las columnas; el `index=` especifica los nombres de las filas.

In [ ]:
pd.DataFrame(
    data = [[1, 2, 3], 
            [4, 5, 6]], 
    columns=['a', 'b', 'c'], 
    index=['foo', 'bar'])

Hay MUCHAS maneras de hacer cualquier cosa. Esto hace que el aprendizaje sea más difícil. Pero aquí vamos de todos modos.

### 8.- Hacer un DataFrame 'classrooms' que contenga:

```python 
> print(classrooms)

         chairs  projectors
gym           0           1
history       2           3
math          4           5
english       6           7
```

In [53]:
#Código:
classrooms = pd.DataFrame(data=[[0,1],[2,3],[4,5],[6,7]],columns=["chairs","projectors"],index=["gym","history","math","english"]);

classrooms

         chairs  projectors
gym           0           1
history       2           3
math          4           5
english       6           7

### 9.- Hacer la Serie 'Chairs':

```python 
gym        0
history    2
math       4
english    6
Name: chairs, dtype: int64
```

In [56]:
#Código:
chairs = pd.Series({"gym":0,"history":2,"math":4,"english":6});
chairs

gym        0
history    2
math       4
english    6
dtype: int64

### 10.- Hacer la serie 'projectors' 

```python 
gym        1
history    3
math       5
english    7
Name: projectors, dtype: int64
```

In [65]:
#Código:

projectors = pd.Series({"gym":1,"history":3,"math":5,"english":7})
projectors

gym        1
history    3
math       5
english    7
dtype: int64

### 11.- Hacer de nuevo el DataFrame 'classrooms' , pero esta vez utilizando las series 'chairs' y 'projectors'

```python 
> print(classrooms)

         chairs  projectors
gym           0           1
history       2           3
math          4           5
english       6           7
```

In [66]:
#Código:
classrooms = pd.DataFrame({"chairs":chairs,"projectors": projectors});
print(classrooms)

         chairs  projectors
gym           0           1
history       2           3
math          4           5
english       6           7

### 12.- Crear el DataFrame 'down_up' con dos columnas: 'decreasing' e 'increasing' con los números 1-10 en cada orden


```python
> print(down_up)

   decreasing  increasing
0          10           1
1           9           2
2           8           3
3           7           4
4           6           5
5           5           6
6           4           7
7           3           8
8           2           9
9           1          10
```

In [85]:
#Código:
arr = np.arange(1,11) 
down_up = pd.DataFrame({"decresing":arr[11::-1],"incresing":arr[:11:1]})
down_up

   decresing  incresing
0         10          1
1          9          2
2          8          3
3          7          4
4          6          5
5          5          6
6          4          7
7          3          8
8          2          9
9          1         10

También puede poner una Serie en un DataFrame siempre que tenga un índice que coincida.

## Modificar DataFrames

Los dataframes son MUY parecidos a los arrays de numpy con columnas e índices añadidos.

Pero a diferencia de los arrays (que tienen un tamaño fijo), ¡podemos añadir columnas a un dataframe!

In [86]:
students['was_late'] = [True, False, True, False, False]
students

          grade  height  was_late
Tomas        45      34      True
Angel        56      35     False
Stacy        78      36      True
Michaela     89      37     False
Haden        90      38     False

Tambien es posible a través de un array

In [ ]:
students['was_late'] = np.array([True, False, True, False, False])
students

Pero el arry debe tener una forma de (n, ) o (1, n). No (n, 1). Lo que tiene un poco de sentido, porque eso es tratar de encajar una fila en una columna.

In [89]:
students['was_late'] = np.array([True, False, True, False, False]).reshape(-1,1)
students

          grade  height  was_late
Tomas        45      34      True
Angel        56      35     False
Stacy        78      36      True
Michaela     89      37     False
Haden        90      38     False

```python
# Esto debe dar un error
students['was_late'] = np.array([True, False, True, False, False]).reshape(1,-1)
students
```

### 13.- Agregar la columna 'top_crush' a 'students'. El cual es el nombre del crush de cada estudiante

```python
> print(students)

          grade  height  was_late     top_crush
Tomas        45      34      True         Angel
Angel        56      35     False         Haden
Stacy        78      36      True      Michaela
Michaela     89      37     False         Tomas
Haden        90      38     False  Edgar A. Poe
```

In [90]:
#Código:
students['top_crush'] = np.array(["Angel","Haden","Michaela","Tomas","Edgar A. Poe"]).reshape(-1,1);

students

          grade  height  was_late     top_crush
Tomas        45      34      True         Angel
Angel        56      35     False         Haden
Stacy        78      36      True      Michaela
Michaela     89      37     False         Tomas
Haden        90      38     False  Edgar A. Poe

## Proyección

Al igual que en numpy, es posible hacer una proyección de una serie

In [91]:
students['grade']>75

Tomas       False
Angel       False
Stacy        True
Michaela     True
Haden        True
Name: grade, dtype: bool

Para crear la columna 'above_75_percent'

In [95]:
students['above_75_percent'] = students['grade']>75
students

,grade,height,was_late,top_crush,above_75_percent,taller_than_35
Tomas,45,34,True,Angel,False,False
Angel,56,35,False,Haden,False,False
Stacy,78,36,True,Michaela,True,True
Michaela,89,37,False,Tomas,True,True
Haden,90,38,False,Edgar A. Poe,True,True

Este tipo de proyecciones resultan de gran utilidad.

### 14.- Agregar la columna 'taller_than_35' a students

```python
> print(students[['grade', 'height', 'taller_than_35']])

          grade  height  taller_than_35
Tomas        45      34           False
Angel        56      35           False
Stacy        78      36            True
Michaela     89      37            True
Haden        90      38            True
```

In [97]:
#Código:
students["taller_than_35"] = students['height'] > 35
students[['grade', 'height', 'taller_than_35']]

          grade  height  taller_than_35
Tomas        45      34           False
Angel        56      35           False
Stacy        78      36            True
Michaela     89      37            True
Haden        90      38            True

Los elementos se emparejan por **index**.

## Índices

In [98]:
df = pd.DataFrame(
    [[1, 2, 3], [4, 5, 6]], 
    columns=['a', 'b', 'c'], 
    index=['foo', 'bar'])

In [99]:
# El índice está invertido
df['d'] = pd.Series([4, 5], index=['bar', 'foo'])
df

     a  b  c  d
foo  1  2  3  5
bar  4  5  6  4

Si el índice no coincide el valor se convierte en NaN

In [100]:
df['d'] = pd.Series([4, 5], index=['bar', 'baz'])
df

     a  b  c    d
foo  1  2  3  NaN
bar  4  5  6  4.0

Al agregar una lista o vector en un DataFrame sin índice la columna se inserta en orden

In [101]:
df['e'] = [1, 2]
df

     a  b  c    d  e
foo  1  2  3  NaN  1
bar  4  5  6  4.0  2

Utilizando una Serie se debe tener cuidado ya que si no existe un índice, todos los valores se convierten a NaN

In [102]:
students['was_late'] = pd.Series([True, False, True, False, False])
students

,grade,height,was_late,top_crush,above_75_percent,taller_than_35
Tomas,45,34,NaN,Angel,False,False
Angel,56,35,NaN,Haden,False,False
Stacy,78,36,NaN,Michaela,True,True
Michaela,89,37,NaN,Tomas,True,True
Haden,90,38,NaN,Edgar A. Poe,True,True

Agregar el índice:

In [106]:
students['was_late'] = pd.Series([True, False, True, False, False], index=students.index)
students

,grade,height,was_late,top_crush,above_75_percent,taller_than_35
Tomas,45,34,True,Angel,False,False
Angel,56,35,False,Haden,False,False
Stacy,78,36,True,Michaela,True,True
Michaela,89,37,False,Tomas,True,True
Haden,90,38,False,Edgar A. Poe,True,True

### 15.- Crear el  dataframe 'numbers' con la columna `increasing`, la cual contenga numeros de 1-50 en este orden. Después, insertar una columna `evens`, que contenga solo números pares si el número es par en `increasing` 

```python
> print(numbers)

    increasing  evens
0            0    0.0
1            1    NaN
2            2    2.0
3            3    NaN
4            4    4.0
5            5    NaN
6            6    6.0
7            7    NaN
8            8    8.0
9            9    NaN
10          10   10.0
.            .      .
.            .      .
.            .      .

```

In [114]:
#Código:
arr = np.arange(51)
numbers = pd.DataFrame({"incresing":arr});
print(arr[arr % 2 == 0])
print(numbers.index[numbers.index % 2 == 0])
numbers["evens"] = pd.Series(arr[arr % 2 == 0],index=arr[arr % 2 == 0])

numbers

[ 0  2  4  6  8 10 12 14 16 18 20 22 24 26 28 30 32 34 36 38 40 42 44 46
 48 50]
Int64Index([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32,
            34, 36, 38, 40, 42, 44, 46, 48, 50],
           dtype='int64')

    incresing  evens
0           0    0.0
1           1    NaN
2           2    2.0
3           3    NaN
4           4    4.0
5           5    NaN
6           6    6.0
7           7    NaN
8           8    8.0
9           9    NaN
10         10   10.0
11         11    NaN
12         12   12.0
13         13    NaN
14         14   14.0
15         15    NaN
16         16   16.0
17         17    NaN
18         18   18.0
19         19    NaN
20         20   20.0
21         21    NaN
22         22   22.0
23         23    NaN
24         24   24.0
25         25    NaN
26         26   26.0
27         27    NaN
28         28   28.0
29         29    NaN
30         30   30.0
31         31    NaN
32         32   32.0
33         33    NaN
34         34   34.0
35         35    NaN
36         36   36.0
37         37    NaN
38         38   38.0
39         39    NaN
40         40   40.0
41         41    NaN
42         42   42.0
43         43    NaN
44         44   44.0
45         45    NaN
46         46   46.0
47         47    NaN
48         48   48.0
49         49    NaN
50         50   50.0

### 16.- Agregar la siguiente información en una columna 'pickup_time'

Haden = 4,
Tomas = 5,
Stacy = 3


```python
> print(students[['grade', 'height', 'pickup_time']])

          grade  height  pickup_time
Tomas        45      34          5.0
Angel        56      35          NaN
Stacy        78      36          3.0
Michaela     89      37          NaN
Haden        90      38          4.0

```

In [116]:
#Código:
students["pickup_time"] = pd.Series({"Haden":4,"Tomas":5,"Stacy":3});
students

,grade,height,was_late,top_crush,above_75_percent,taller_than_35,pickup_time
Tomas,45,34,True,Angel,False,False,5.0
Angel,56,35,False,Haden,False,False,NaN
Stacy,78,36,True,Michaela,True,True,3.0
Michaela,89,37,False,Tomas,True,True,NaN
Haden,90,38,False,Edgar A. Poe,True,True,4.0

### 17.- Agregar la siguiente informaión para los primeros tres estudiantes, el resto puede ser NaN

4,5,3


```python
> print(students[['grade', 'height', 'pickup_time']])

          grade  height  pickup_time
Tomas        45      34          4.0
Angel        56      35          5.0
Stacy        78      36          2.0
Michaela     89      37          NaN
Haden        90      38          NaN

```

(NaN is input as np.NaN)

In [127]:
#Código:
students["pickup_time"] = pd.Series([4,5,3],index = students.index[:3]);
students

,grade,height,was_late,top_crush,above_75_percent,taller_than_35,pickup_time
Tomas,45,34,True,Angel,False,False,4.0
Angel,56,35,False,Haden,False,False,5.0
Stacy,78,36,True,Michaela,True,True,3.0
Michaela,89,37,False,Tomas,True,True,NaN
Haden,90,38,False,Edgar A. Poe,True,True,NaN

## Carga de información

Para cargar información externa en Pandas primero debemos localizarla

El comando 'ls' es de ayuda para esto

In [128]:
ls

 El volumen de la unidad C es OS
 El n£mero de serie del volumen es: AC96-7F87

 Directorio de C:\Users\NGALAZ

14/10/2022  06:27 p. m.    <DIR>          .
14/10/2022  06:27 p. m.    <DIR>          ..
05/09/2020  11:13 p. m.    <DIR>          .android
31/05/2021  01:19 p. m.    <DIR>          .azuredatastudio
28/09/2022  01:41 p. m.               406 .bash_history
26/09/2022  10:54 p. m.               201 .bash_profile
29/05/2021  02:21 p. m.    <DIR>          .cache
26/09/2022  11:08 p. m.    <DIR>          .conda
21/04/2020  10:29 a. m.    <DIR>          .config
13/09/2021  12:53 p. m.    <DIR>          .dbus-keyrings
04/03/2022  01:07 p. m.    <DIR>          .electron-gyp
06/09/2020  05:42 p. m.    <DIR>          .expo
04/06/2021  05:29 p. m.               200 .gitconfig
22/07/2021  04:20 p. m.    <DIR>          .InstallAnywhere
14/10/2022  04:19 p. m.    <DIR>          .ipynb_checkpoints
12/10/2022  04:09 p. m.    <DIR>          .ipython
12/10/2022  04:05 p. m.    <DIR>          .jupyter
07/10/2021  12:00 p. m.                20 .lesshst
22/07/2021  04:18 p. m.    <DIR>          .LOGOComfort7.0
22/07/2021  04:53 p. m.    <DIR>          .LOGOComfort8.3
22/07/2021  04:27 p. m.    <DIR>          .lwe
22/07/2021  04:27 p. m.    <DIR>          .lwe-installer
14/10/2022  04:21 p. m.    <DIR>          .matplotlib
21/07/2022  09:59 a. m.    <DIR>          .ms-ad
10/06/2021  09:38 a. m.                49 .node_repl_history
14/10/2022  12:59 p. m.    <DIR>          .node-red
14/07/2021  04:43 p. m.    <DIR>          .pm2
05/09/2020  11:13 p. m.    <DIR>          .react-native-cli
03/08/2022  05:36 p. m.    <DIR>          .ssh
21/04/2020  11:52 a. m.    <DIR>          .vscode
04/03/2022  01:21 p. m.    <DIR>          .windows-build-tools
02/07/2020  12:01 a. m.               121 .yarnrc
29/08/2022  10:18 a. m.    <DIR>          3D Objects
14/10/2022  06:27 p. m.           118,418 Actividad 1 R2.ipynb
12/10/2022  05:55 p. m.             4,349 Actividad1.ipynb
26/09/2022  10:39 p. m.    <DIR>          Anaconda3
29/08/2022  10:18 a. m.    <DIR>          Contacts
11/10/2022  08:37 a. m.    <DIR>          deacero.com
12/10/2022  06:01 p. m.    <DIR>          Desktop
26/09/2022  10:38 p. m.    <DIR>          Documents
14/10/2022  04:47 p. m.    <DIR>          Downloads
29/08/2022  10:18 a. m.    <DIR>          Favorites
29/08/2022  10:18 a. m.    <DIR>          Links
29/08/2022  10:18 a. m.    <DIR>          Music
13/10/2022  05:02 p. m.             3,513 numpy.ipynb
02/06/2021  11:26 a. m.    <DIR>          OneDrive
13/10/2022  06:18 p. m.    <DIR>          OneDrive - deacero.com
13/10/2022  05:53 p. m.             1,841 Pandas.ipynb
29/09/2022  04:07 p. m.    <DIR>          Pictures
28/04/2020  07:17 p. m.    <DIR>          Postman
07/04/2021  06:25 p. m.                13 query
15/04/2020  10:56 a. m.    <DIR>          Roaming
14/09/2021  06:43 p. m.             3,028 sample.pdf
29/08/2022  10:18 a. m.    <DIR>          Saved Games
29/08/2022  10:18 a. m.    <DIR>          Searches
14/10/2022  04:20 p. m.               589 Untitled.ipynb
11/10/2022  01:25 p. m.    <DIR>          Videos
              13 archivos        132,748 bytes
              44 dirs  177,314,844,672 bytes libres

probablemente se encuentre en 'data/'

In [129]:
ls data

 El volumen de la unidad C es OS
 El n£mero de serie del volumen es: AC96-7F87

 Directorio de C:\Users\NGALAZ

No se encuentra el archivo

Pandas puede cargar csv, aunque algunas veces el csv no está separado por comas. Revisemos lo que está dentro de playgolf.csv

In [132]:
# '!' significa que estamos ejecutando un comando de bash
!type C:\Users\NGALAZ\Documents\Repositorios\Review2-Files\playgolf.csv

Date,Outlook,Temperature,Humidity,Windy,Result
7/1/14,sunny,85,85,FALSE,Don't Play
7/2/14,sunny,80,90,TRUE,Don't Play
7/3/14,overcast,83,78,FALSE,Play
7/4/14,rain,70,96,FALSE,Play
7/5/14,rain,68,80,FALSE,Play
7/6/14,rain,65,70,TRUE,Don't Play
7/7/14,overcast,64,65,TRUE,Play
7/8/14,sunny,72,95,FALSE,Don't Play
7/9/14,sunny,69,70,FALSE,Play
7/10/14,rain,75,80,FALSE,Play
7/11/14,sunny,75,70,TRUE,Play
7/12/14,overcast,72,90,TRUE,Play
7/13/14,overcast,81,75,FALSE,Play
7/14/14,rain,71,80,TRUE,Don't Play

In [134]:
!head -1 data/playgolf.csv

"head" no se reconoce como un comando interno o externo,
programa o archivo por lotes ejecutable.

###  Cargar datos desde csv

Un csv (valores separados por comas) es un formato de archivo utilizado para almacenar datos separados por un **delimitador**.

Un delimitador es el **carácter único** que divide los elementos de datos en un archivo.  La coma es una opción tradicional de delimitador, pero relativamente pobre porque a menudo forma parte de los propios elementos.  Las mejores opciones son el pipe (`|`) y el tabulador (`\t`).

En un extraño giro de la historia, los archivos separados por comas a menudo se separan con caracteres diferentes a las comas.  No hay una convención consistente de usar una extensión de archivo diferente, pero algunas personas usan `.psv` o `.tsv`.

Pandas tiene una función `read_csv` que carga un fichero delimitado en un `DataFrame`.

In [136]:
golf_df = pd.read_csv('C:/Users/NGALAZ/Documents/Repositorios/Review2-Files/playgolf.csv', delimiter=',')

In [137]:
golf_df

       Date   Outlook  Temperature  Humidity  Windy      Result
0    7/1/14     sunny           85        85  False  Don't Play
1    7/2/14     sunny           80        90   True  Don't Play
2    7/3/14  overcast           83        78  False        Play
3    7/4/14      rain           70        96  False        Play
4    7/5/14      rain           68        80  False        Play
5    7/6/14      rain           65        70   True  Don't Play
6    7/7/14  overcast           64        65   True        Play
7    7/8/14     sunny           72        95  False  Don't Play
8    7/9/14     sunny           69        70  False        Play
9   7/10/14      rain           75        80  False        Play
10  7/11/14     sunny           75        70   True        Play
11  7/12/14  overcast           72        90   True        Play
12  7/13/14  overcast           81        75  False        Play
13  7/14/14      rain           71        80   True  Don't Play

### 18.- Cargar hospital-costs.csv como 'hospital_costs'.

In [140]:
#Código:
hospital_cost = pd.read_csv('C:/Users/NGALAZ/Documents/Repositorios/Review2-Files/hospital-costs.csv',delimiter=",")
hospital_cost

,Year,Facility Id,Facility Name,APR DRG Code,APR Severity of Illness Code,APR DRG Description,APR Severity of Illness Description,APR Medical Surgical Code,APR Medical Surgical Description,Discharges,Mean Charge,Median Charge,Mean Cost,Median Cost
0,2011,324,Adirondack Medical Center-Saranac Lake Site,4,4,Tracheostomy W MV 96+ Hours W Extensive Proced...,Extreme,P,Surgical,3,361289.0,210882.0,196080.0,123347.0
1,2011,324,Adirondack Medical Center-Saranac Lake Site,5,4,Tracheostomy W MV 96+ Hours W/O Extensive Proc...,Extreme,P,Surgical,1,102190.0,102190.0,59641.0,59641.0
2,2011,324,Adirondack Medical Center-Saranac Lake Site,24,2,Extracranial Vascular Procedures,Moderate,P,Surgical,6,14172.0,13506.0,6888.0,6445.0
3,2011,324,Adirondack Medical Center-Saranac Lake Site,26,1,Other Nervous System & Related Procedures,Minor,P,Surgical,1,8833.0,8833.0,4259.0,4259.0
4,2011,324,Adirondack Medical Center-Saranac Lake Site,41,1,Nervous System Malignancy,Minor,M,Medical,1,5264.0,5264.0,1727.0,1727.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
383488,2009,1153,Wyoming County Community Hospital,951,3,Moderately Extensive Procedure Unrelated To Pr...,Major,P,Surgical,5,13572.0,12615.0,14433.0,15835.0
383489,2009,1153,Wyoming County Community Hospital,952,3,Nonextensive Procedure Unrelated To Principal ...,Major,P,Surgical,4,8323.0,8179.0,9520.0,8674.0
383490,2009,1153,Wyoming County Community Hospital,952,2,Nonextensive Procedure Unrelated To Principal ...,Moderate,P,Surgical,5,7746.0,5120.0,7257.0,5321.0
383491,2009,1153,Wyoming County Community Hospital,952,1,Nonextensive Procedure Unrelated To Principal ...,Minor,P,Surgical,1,7892.0,7892.0,6528.0,6528.0
383492,2009,1153,Wyoming County Community Hospital,956,0,Ungroupable,NaN,NaN,Other,3,1069.0,1309.0,1719.0,1756.0

### 19.- Cargar winnequality-white.csv como 'wine_quality_white'.

In [144]:
#Código:
wine_quality_white = pd.read_csv('C:/Users/NGALAZ/Documents/Repositorios/Review2-Files/winequality-white.csv',delimiter=";")
wine_quality_white

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.00100,3.00,0.45,8.8,6
1,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.99400,3.30,0.49,9.5,6
2,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.99510,3.26,0.44,10.1,6
3,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.99560,3.19,0.40,9.9,6
4,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.99560,3.19,0.40,9.9,6
...,...,...,...,...,...,...,...,...,...,...,...,...
4893,6.2,0.21,0.29,1.6,0.039,24.0,92.0,0.99114,3.27,0.50,11.2,6
4894,6.6,0.32,0.36,8.0,0.047,57.0,168.0,0.99490,3.15,0.46,9.6,5
4895,6.5,0.24,0.19,1.2,0.041,30.0,111.0,0.99254,2.99,0.46,9.4,6
4896,5.5,0.29,0.30,1.1,0.022,20.0,110.0,0.98869,3.34,0.38,12.8,7
4897,6.0,0.21,0.38,0.8,0.020,22.0,98.0,0.98941,3.26,0.32,11.8,6

## Extraer información del DataFrame

#### Índices de Fila y Columna

Como hemos visto, se pueden extraer columnas individuales de un `DataFrame` como una `Serie` utilizando la indexación habitual de estilo `__getitem__` utilizando el nombre de la columna.  

Esto es similar a cómo indexamos un diccionario.

In [145]:
golf_df['Temperature']

0     85
1     80
2     83
3     70
4     68
5     65
6     64
7     72
8     69
9     75
10    75
11    72
12    81
13    71
Name: Temperature, dtype: int64

Para extraer valores individuales

In [146]:
golf_df['Temperature'][0]

85

Para extraer múltiples columnas

In [147]:
golf_df[['Temperature', 'Humidity']]

    Temperature  Humidity
0            85        85
1            80        90
2            83        78
3            70        96
4            68        80
5            65        70
6            64        65
7            72        95
8            69        70
9            75        80
10           75        70
11           72        90
12           81        75
13           71        80

Para extraer un número limitado de filas

In [148]:
short_df = golf_df[0:5]
short_df

     Date   Outlook  Temperature  Humidity  Windy      Result
0  7/1/14     sunny           85        85  False  Don't Play
1  7/2/14     sunny           80        90   True  Don't Play
2  7/3/14  overcast           83        78  False        Play
3  7/4/14      rain           70        96  False        Play
4  7/5/14      rain           68        80  False        Play

### 20.- Extraer las columnas Facility Id, Year, Discharges, and Mean Charge de hospital_costs

```python
        Facility Id  Year  Discharges  Mean Charge
0               324  2011           3     361289.0
1               324  2011           1     102190.0
2               324  2011           6      14172.0
3               324  2011           1       8833.0
4               324  2011           1       5264.0
...             ...   ...         ...          ...
383488         1153  2009           5      13572.0
383489         1153  2009           4       8323.0
383490         1153  2009           5       7746.0
383491         1153  2009           1       7892.0
383492         1153  2009           3       1069.0
```

In [151]:
#Código:
hospital_cost[["Facility Id","Year","Discharges","Mean Charge"]]

        Facility Id  Year  Discharges  Mean Charge
0               324  2011           3     361289.0
1               324  2011           1     102190.0
2               324  2011           6      14172.0
3               324  2011           1       8833.0
4               324  2011           1       5264.0
...             ...   ...         ...          ...
383488         1153  2009           5      13572.0
383489         1153  2009           4       8323.0
383490         1153  2009           5       7746.0
383491         1153  2009           1       7892.0
383492         1153  2009           3       1069.0

[383493 rows x 4 columns]

## Índie Booleano / Logico

También podemos indexar un `DataFrame` utilizando una lista de **booleanos** (es decir, valores `True` y `False`). Esto también operará sobre las filas.

In [155]:
# Filas 0, 2, y 4.
short_df[[True, False, True, False, True]]

     Date   Outlook  Temperature  Humidity  Windy      Result
0  7/1/14     sunny           85        85  False  Don't Play
2  7/3/14  overcast           83        78  False        Play
4  7/5/14      rain           68        80  False        Play

Es de utilidad para crear `Series` booleanas a partir de una comparación

In [156]:
# A series of booleans.
golf_df['Temperature'] > 70

0      True
1      True
2      True
3     False
4     False
5     False
6     False
7      True
8     False
9      True
10     True
11     True
12     True
13     True
Name: Temperature, dtype: bool

Y después elegir las columnas del DataFrame

In [157]:
golf_df[golf_df['Temperature'] > 70][["Date", "Windy"]]

       Date  Windy
0    7/1/14  False
1    7/2/14   True
2    7/3/14  False
7    7/8/14  False
9   7/10/14  False
10  7/11/14   True
11  7/12/14   True
12  7/13/14  False
13  7/14/14   True

Esto es esencialmente aplicar una condición lógica para seleccionar filas de un `DataFrame`.  Este es uno de los patrones más comunes en Pandas.

Para repasar: si indexas un `DataFrame` con un **valor único** o una **lista de valores**, selecciona las **columnas**.

Si utilizas un **corte** o una **secuencia de booleanos**, selecciona las **filas**.

### 21.- Seleccionar los días en que la humedad es mayor a 90 en 'golf_df'.

```python
     Date Outlook  Temperature  Humidity  Windy      Result
3  7/4/14    rain           70        96  False        Play
7  7/8/14   sunny           72        95  False  Don't Play
```

In [161]:
#Código:
golf_df[golf_df["Humidity"] > 90][["Date","Humidity"]]

     Date  Humidity
3  7/4/14        96
7  7/8/14        95

## Operadores lógicos

In [162]:
(golf_df['Humidity']>90) | (golf_df['Outlook']=="Sunny") # '|' es 'OR'

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11    False
12    False
13    False
dtype: bool

In [163]:
(golf_df['Result']=="Don't Play") & golf_df['Windy'] # '&' es 'AND'

0     False
1      True
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
dtype: bool

### 22.- Seleccionar los días lluviosos con una temperatura menor a 70 grados en 'play_golf'

In [173]:
#Código:
#(golf_df['Temperature'] > 70) &  (golf_df["Outlook"]=="rain")
golf_df[(golf_df['Temperature'] < 70) & (golf_df["Outlook"]=="rain")]

     Date Outlook  Temperature  Humidity  Windy      Result
4  7/5/14    rain           68        80  False        Play
5  7/6/14    rain           65        70   True  Don't Play

### 23.- Seleccionar la fecha y el resultado de los días lluviosos en que la humedad es mayor a 90 en 'play_golf'

```python
     Date Result
3  7/4/14   Play
```

In [175]:
#Código:
golf_df[ golf_df["Humidity"] > 90 ][["Date","Result"]]

     Date      Result
3  7/4/14        Play
7  7/8/14  Don't Play

## Doble índice

Supongamos que queremos establecer el valor de la columna `Windy` donde `Temperature > 70` como True.

In [176]:
golf_df[golf_df['Temperature'] > 70]["Windy"] = True

C:\Users\NGALAZ\AppData\Local\Temp\ipykernel_44020\2343633056.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  golf_df[golf_df['Temperature'] > 70]["Windy"] = True

Vaya, un error

In [177]:
golf_df[golf_df['Temperature'] > 70]["Windy"]

0     False
1      True
2     False
7     False
9     False
10     True
11     True
12    False
13     True
Name: Windy, dtype: bool

Al parecer, aún es Falso

Este patrón se llama doble indexación, ¡y es un antipatrón!  ¡Pandas no puede garantizar que las asignaciones se mantengan cuando se indexa dos veces!

Para solucionar estos problemas, tenemos que estudiar las otras opciones de indexación que proporciona Pandas.

#### .loc e .iloc

Hay algunos otros objetos de indexación en pandas, los cuales toman un valor para elegir las filas y un valor para elegir las columnas.

  - `df.iloc` está **basado en la posición**.  Este indexador acepta enteros y trozos de enteros, y esencialmente trata el marco de datos como si fuera una simple matriz.
  - `df.loc` está **basado en etiquetas**.  Este indexador trabaja con índices/etiquetas de filas y columnas.

In [178]:
df = pd.DataFrame({
    'some_integers': [0, 0, 1, 1, 2, 2],
    'some_strings': ['x', 'y', 'z', 'x', 'y', 'z'],
    'some_booleans': [0, 0, 1, 0, 1, 1]},
    index=['a', 'b', 'c', 'd', 'e', 'f']
)
df

   some_integers some_strings  some_booleans
a              0            x              0
b              0            y              0
c              1            z              1
d              1            x              0
e              2            y              1
f              2            z              1

In [179]:
df.iloc[2:4, 0:2]

   some_integers some_strings
c              1            z
d              1            x

In [180]:
df.loc['b':'e', ['some_integers', 'some_booleans']]

   some_integers  some_booleans
b              0              0
c              1              1
d              1              0
e              2              1

### 24.- Seleccionar las filas a,b,c, y f 

```python
   some_integers some_strings  some_booleans
a              0            x              0
b              0            y              0
c              1            z              1
f              2            z              1
```

In [183]:
#Código:
df.loc[['a','b','c','f']]

   some_integers some_strings  some_booleans
a              0            x              0
b              0            y              0
c              1            z              1
f              2            z              1

### 25.- Seleccionar la fila 0, 1a y 5a

```python
   some_integers some_strings  some_booleans
a              0            x              0
b              0            y              0
f              2            z              1
```

In [184]:
#Código:
df.iloc[[0,1,5]]

   some_integers some_strings  some_booleans
a              0            x              0
b              0            y              0
f              2            z              1

### 26.- Seleccionar los estudiantes 0 y 4o

```python
       grade  height was_late     top_crush   ...
Tomas     45      34      NaN         Angel
Haden     90      38      NaN  Edgar A. Poe
```

In [185]:
#Código:
students.iloc[[0,4]]

,grade,height,was_late,top_crush,above_75_percent,taller_than_35,pickup_time
Tomas,45,34,True,Angel,False,False,4.0
Haden,90,38,False,Edgar A. Poe,True,True,NaN

### 27.- Seleccionar a Haden, Angel y Micaela en ese orden

```python
          grade  height was_late     top_crush
Haden        90      38      NaN  Edgar A. Poe
Angel        56      35      NaN         Haden
Michaela     89      37      NaN         Tomas
```

In [187]:
#Código:
students.loc[["Haden","Angel","Michaela"]]

,grade,height,was_late,top_crush,above_75_percent,taller_than_35,pickup_time
Haden,90,38,False,Edgar A. Poe,True,True,NaN
Angel,56,35,False,Haden,False,False,5.0
Michaela,89,37,False,Tomas,True,True,NaN

## Índice mixto

Entonces, ¿qué hacemos si queremos obtener las filas por posición, y obtener las columnas por etiqueta?  Es decir, si tenemos un uso para la **indexación mixta**.

```python
# Mixto con iloc: no funciona.
>>> df.iloc[2:4, ['some_integers', 'some_booleans']]

---------------------------------------------------------------------------
IndexError                                Traceback (most recent call last)
<ipython-input-337-dcc694afee25> in <module>
      1 # Mixto con iloc: no funciona.
----> 2 df.iloc[2:4, ['some_integers', 'some_booleans']]
```

Hacer una indexación mixta en los pandas modernos es más explícito, menos mágico.  Es necesario utilizar los atributos `df.index` y `df.columns` para convertir explícitamente las posiciones en etiquetas.

#### Filas por posición, Columnas por nombre

In [188]:
df.index[2:4]

Index(['c', 'd'], dtype='object')

In [220]:
df.loc[df.index[2:4], ['some_integers', 'some_booleans']]

   some_integers  some_booleans
c              1              1
d              1              0

#### Filas por nombre, Columnas por posición

In [189]:
df.columns[[0, 2]]

Index(['some_integers', 'some_booleans'], dtype='object')

In [190]:
df.loc[['c', 'd'], df.columns[[0, 2]]]

   some_integers  some_booleans
c              1              1
d              1              0

### 28.- Utilizar el índice mixto para obtener la fila 0, 2a y 4a row de top_crush y pickup_time

```python
          top_crush  pickup_time
Tomas         Angel          4.0
Stacy      Michaela          2.0
Haden  Edgar A. Poe          NaN
```

In [227]:
#Código:

students.loc[students.index[[0,2,4]],["top_crush","pickup_time"]]

          top_crush  pickup_time
Tomas         Angel          4.0
Stacy      Michaela          3.0
Haden  Edgar A. Poe          NaN

### 29.- Utilizar el índice mixto para obtener el siguiente dataframe, utilizando posición en columns y nombre en filas

```python
       grade  was_late  above_75_percent  grade
Stacy     78      True              True     78
Haden     90     False              True     90
```

In [234]:
#Código:
students.loc[["Stacy","Haden"],students.columns[[0,2,4,0]]]

       grade  was_late  above_75_percent  grade
Stacy     78      True              True     78
Haden     90     False              True     90

## Transformaciones

Las operaciones aritméticas se aplican a las `Series` elemento a elemento. (como las matrices)

In [236]:
# Ejemplo
golf_df["TempHumid"] = golf_df['Temperature'] + golf_df['Humidity']

In [237]:
golf_df.head()

     Date   Outlook  Temperature  Humidity  Windy      Result  TempHumid
0  7/1/14     sunny           85        85  False  Don't Play        170
1  7/2/14     sunny           80        90   True  Don't Play        170
2  7/3/14  overcast           83        78  False        Play        161
3  7/4/14      rain           70        96  False        Play        166
4  7/5/14      rain           68        80  False        Play        148

In [238]:
# Calcular el índice de calor

#    https://en.wikipedia.org/wiki/Heat_index
temp = golf_df['Temperature']
humid = golf_df['Humidity']
golf_df['HeatIndex'] = (-42.37 + 2.05*temp + 10.14*humid
                        - 0.225*temp*humid
                        - 6.84e-3*temp**2 
                        - 5.482e-2*humid**2
                        + 1.23e-3*temp**2*humid
                        + 8.53e-4*temp*humid**2
                        - 1.99e-6*temp**2*humid**2
)
golf_df[['Temperature', 'Humidity', 'HeatIndex']].head()

   Temperature  Humidity  HeatIndex
0           85        85  98.004631
1           80        90  84.474400
2           83        78  89.669911
3           70        96  62.847024
4           68        80  69.089776

### 30.- Crear una columna 'smarty_pants' que devuelva 'Verdadero' si el grade de un estudiante es mayor a 2.2 veces su estatura

```python
>>> print(students[['grade','height', 'smarty_pants']])
          grade  height  smarty_pants
Tomas        45      34         False
Angel        56      35         False
Stacy        78      36         False
Michaela     89      37          True
Haden        90      38          True
```

In [242]:
#Código:
students["smarty_pants"] = (students["grade"]> (students["height"]*2.2))
print(students[['grade','height', 'smarty_pants']])

          grade  height  smarty_pants
Tomas        45      34         False
Angel        56      35         False
Stacy        78      36         False
Michaela     89      37          True
Haden        90      38          True

### 31.- Crear una columna 'percent fixed acidity' que calcule la cantidad de acidez total que se encuentra en wine_quality_white.

```python
>>> print(wine_quality_white[['fixed acidity', 'volatile acidity', 'citric acid', 'percent fixed acidity']])
      fixed acidity  volatile acidity  citric acid  percent fixed acidity
0               7.0              0.27         0.36               0.917431
1               6.3              0.30         0.34               0.907781
2               8.1              0.28         0.40               0.922551
3               7.2              0.23         0.32               0.929032
4               7.2              0.23         0.32               0.929032
...             ...               ...          ...                    ...
4893            6.2              0.21         0.29               0.925373
4894            6.6              0.32         0.36               0.906593
4895            6.5              0.24         0.19               0.937951
4896            5.5              0.29         0.30               0.903120
4897            6.0              0.21         0.38               0.910470
```

In [ ]:
#Código:

## Apply

Es posible crear una nueva Serie al aplicar una función a una Serie existente

Ejemplo: Extraer el día del mes en la columna 'date'

In [243]:
golf_df

,Date,Outlook,Temperature,Humidity,Windy,Result,TempHumid,HeatIndex
0,7/1/14,sunny,85,85,False,Don't Play,170,98.004631
1,7/2/14,sunny,80,90,True,Don't Play,170,84.474400
2,7/3/14,overcast,83,78,False,Play,161,89.669911
3,7/4/14,rain,70,96,False,Play,166,62.847024
4,7/5/14,rain,68,80,False,Play,148,69.089776
5,7/6/14,rain,65,70,True,Don't Play,135,73.668025
6,7/7/14,overcast,64,65,True,Play,129,75.987116
7,7/8/14,sunny,72,95,False,Don't Play,167,66.247396
8,7/9/14,sunny,69,70,False,Play,139,72.843649
9,7/10/14,rain,75,80,False,Play,155,74.557000
10,7/11/14,sunny,75,70,True,Play,145,75.777625
11,7/12/14,overcast,72,90,True,Play,162,68.106944
12,7/13/14,overcast,81,75,False,Play,156,84.523441
13,7/14/14,rain,71,80,True,Don't Play,151,70.486984

In [244]:
golf_df['Date'].apply(lambda x: x.split('/')[1])

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
Name: Date, dtype: object

Apply toma cada elemento de la serie 'date' y le *aplica* la función. Las salidas se ordenan en un array de la misma forma e índice.

Así que podemos guardarlo así

In [245]:
golf_df['day'] = golf_df['Date'].apply(lambda x: x.split('/')[1])
golf_df

,Date,Outlook,Temperature,Humidity,Windy,Result,TempHumid,HeatIndex,day
0,7/1/14,sunny,85,85,False,Don't Play,170,98.004631,1
1,7/2/14,sunny,80,90,True,Don't Play,170,84.474400,2
2,7/3/14,overcast,83,78,False,Play,161,89.669911,3
3,7/4/14,rain,70,96,False,Play,166,62.847024,4
4,7/5/14,rain,68,80,False,Play,148,69.089776,5
5,7/6/14,rain,65,70,True,Don't Play,135,73.668025,6
6,7/7/14,overcast,64,65,True,Play,129,75.987116,7
7,7/8/14,sunny,72,95,False,Don't Play,167,66.247396,8
8,7/9/14,sunny,69,70,False,Play,139,72.843649,9
9,7/10/14,rain,75,80,False,Play,155,74.557000,10
10,7/11/14,sunny,75,70,True,Play,145,75.777625,11
11,7/12/14,overcast,72,90,True,Play,162,68.106944,12
12,7/13/14,overcast,81,75,False,Play,156,84.523441,13
13,7/14/14,rain,71,80,True,Don't Play,151,70.486984,14

lambda es sólo una forma de hacer una función. También podemos aplicar una función previamente definida.

In [246]:
def get_day(x):
    return x.split('/')[1]

golf_df['Date'].apply(get_day)

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
Name: Date, dtype: object

Es posible aplicar una función a cada fila del DataFrame especificando la columna y su eje=1

In [247]:
golf_df.apply(lambda x: x['Temperature'] + x['Humidity'], axis=1)

0     170
1     170
2     161
3     166
4     148
5     135
6     129
7     167
8     139
9     155
10    145
11    162
12    156
13    151
dtype: int64

En general, `.apply` es útil para mapear funciones complejas en sus datos.

### 32.- Crear una columna 'report_card' que muestre 'FAILURE' si el 'grade' de un estudiante es menor a 60, y que muestre su calificación si es mayor a 60

```python
>>> print(students[['grade','height', 'report_card']])
          grade  height report_card
Tomas        45      34     FAILURE
Angel        56      35     FAILURE
Stacy        78      36          78
Michaela     89      37          89
Haden        90      38          90
```

In [249]:
#Código:
def calificar(valor):
    if(valor < 60):
        return 'FAILURE'
    else:
        return valor
    
students["report_card"] = students["grade"].apply(calificar);

students[['grade','height', 'report_card']]

          grade  height report_card
Tomas        45      34     FAILURE
Angel        56      35     FAILURE
Stacy        78      36          78
Michaela     89      37          89
Haden        90      38          90

### 33.- Crear una columna 'even_height' que muestre 'Even' si su estatura es un numero par, y que muestre 'odd' si su estatura es un número impar.

```python
>>> print(students[['grade','height', 'even_height']])
          grade  height even_height
Tomas        45      34        Even
Angel        56      35         Odd
Stacy        78      36        Even
Michaela     89      37         Odd
Haden        90      38        Even
```

In [252]:
#Código:
def esPar(x):
    if(x % 2 == 0):
        return 'Even'
    else:
        return 'Odd'
    
students["even_height"] = students["height"].apply(esPar);

students[['grade','height', 'even_height']]

          grade  height even_height
Tomas        45      34        Even
Angel        56      35         Odd
Stacy        78      36        Even
Michaela     89      37         Odd
Haden        90      38        Even

## Agregaciones

Existen MUCHOS métodos disponibles para nosotros dentro de cada dataframe. Algunos de ellos son agregaciones, al igual que en numpy.

In [253]:
golf_df.count() #Cuenta items que no son None

Date           14
Outlook        14
Temperature    14
Humidity       14
Windy          14
Result         14
TempHumid      14
HeatIndex      14
day            14
dtype: int64

In [256]:
golf_df.count(axis=1)

0     9
1     9
2     9
3     9
4     9
5     9
6     9
7     9
8     9
9     9
10    9
11    9
12    9
13    9
dtype: int64

In [257]:
golf_df.mean()

C:\Users\NGALAZ\AppData\Local\Temp\ipykernel_44020\4288686865.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  golf_df.mean()

Temperature    7.357143e+01
Humidity       8.028571e+01
Windy          4.285714e-01
TempHumid      1.538571e+02
HeatIndex      7.616314e+01
day            8.818342e+16
dtype: float64

In [258]:
golf_df.sum()

Date           7/1/147/2/147/3/147/4/147/5/147/6/147/7/147/8/...
Outlook        sunnysunnyovercastrainrainrainovercastsunnysun...
Temperature                                                 1030
Humidity                                                    1124
Windy                                                          6
Result         Don't PlayDon't PlayPlayPlayPlayDon't PlayPlay...
TempHumid                                                   2154
HeatIndex                                            1066.283922
day                                          1234567891011121314
dtype: object

In [259]:
golf_df.aggregate(min)

Date               7/1/14
Outlook          overcast
Temperature            64
Humidity               65
Windy               False
Result         Don't Play
TempHumid             129
HeatIndex       62.847024
day                     1
dtype: object

¿Qué pasa si queremos calcular la temperatura mínima en días nublados, lluviosos o soleados? 

¡Usamos una sentencia groupby! Como en sql.

In [260]:
golf_df.groupby('Outlook').aggregate(min)

,Date,Temperature,Humidity,Windy,Result,TempHumid,HeatIndex,day
Outlook,,,,,,,,
overcast,7/12/14,64,65,False,Play,129,68.106944,12
rain,7/10/14,65,70,False,Don't Play,135,62.847024,10
sunny,7/1/14,69,70,False,Don't Play,139,66.247396,1

Esto toma el mínimo de cada __Outlook__ de *cada* otra columna. ¡Y ahora __Outlook__ es el índice! 

Veamos lo que nos interesa, la temperatura.

In [261]:
golf_df.groupby('Outlook').aggregate(min)[['Temperature']]

          Temperature
Outlook
overcast           64
rain               65
sunny              69

### 34.- Calcular los datos promedio de clima para cada Outlook.

```python
          Temperature  Humidity  Windy  TempHumid  HeatIndex
Outlook                                                     
overcast         75.0      77.0    0.5      152.0  79.571853
rain             69.8      81.2    0.4      151.0  70.129762
sunny            76.2      82.0    0.4      158.2  79.469540
```

In [263]:
#Código:
golf_df.groupby('Outlook').mean()

          Temperature  Humidity  Windy  TempHumid  HeatIndex
Outlook
overcast         75.0      77.0    0.5      152.0  79.571853
rain             69.8      81.2    0.4      151.0  70.129762
sunny            76.2      82.0    0.4      158.2  79.469540

### 35.- Calcular la temperatura Máxima en días windy y non-windy

```python
Windy
False    85
True     80
```

In [270]:
#Código:

golf_df.groupby('Windy').max()[['Temperature']]

       Temperature
Windy
False           85
True            80

Documentación de ayuda para groupby: http://pandas.pydata.org/pandas-docs/stable/groupby.html

## Summaries

`info` funciona para revisar los tipos de datos por columna y revisar al mismo tiempo si existen NaN's

In [271]:
golf_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         14 non-null     object
 1   Outlook      14 non-null     object
 2   Temperature  14 non-null     int64
 3   Humidity     14 non-null     int64
 4   Windy        14 non-null     bool
 5   Result       14 non-null     object
 6   TempHumid    14 non-null     int64
 7   HeatIndex    14 non-null     float64
 8   day          14 non-null     object
dtypes: bool(1), float64(1), int64(3), object(4)
memory usage: 1.0+ KB

`describe` brinda un análisis descriptivo básico

In [272]:
golf_df.describe()

       Temperature   Humidity   TempHumid  HeatIndex
count    14.000000  14.000000   14.000000  14.000000
mean     73.571429  80.285714  153.857143  76.163137
std       6.571667   9.840486   13.242456   9.771440
min      64.000000  65.000000  129.000000  62.847024
25%      69.250000  71.250000  145.750000  69.439078
50%      72.000000  80.000000  155.500000  74.112513
75%      78.750000  88.750000  165.000000  82.352579
max      85.000000  96.000000  170.000000  98.004631

### 36.- Qué columna de wine_quality_white tiene la mayor desviación estándar?

In [278]:
#Código:

golf_df.describe().loc['std'].idxmax();

'TempHumid'

### 37.- Qué columnas son enteros en wine_quality_white?

In [295]:
#Código:

### 38.- Qué columna tiene el percentil 75 más bajo?

## Crosstab

`crosstab` devuelve un conteo de frecuencia entre dos columnas

In [296]:
pd.crosstab(golf_df['Outlook'], golf_df['Result'])

Result    Don't Play  Play
Outlook
overcast           0     4
rain               2     3
sunny              3     2

## DateTimes

Para convertir cadenas de texto a una columna de tipo fecha se utiliza la función `to_datetime`

In [297]:
golf_df['DateTime'] = pd.to_datetime(golf_df['Date'])
golf_df['DateTime']

0    2014-07-01
1    2014-07-02
2    2014-07-03
3    2014-07-04
4    2014-07-05
5    2014-07-06
6    2014-07-07
7    2014-07-08
8    2014-07-09
9    2014-07-10
10   2014-07-11
11   2014-07-12
12   2014-07-13
13   2014-07-14
Name: DateTime, dtype: datetime64[ns]

`day` vs `dayofweek`

In [298]:
golf_df['DateTime'].dt.day

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
Name: DateTime, dtype: int64

In [299]:
golf_df['DateTime'].dt.dayofweek

0     1
1     2
2     3
3     4
4     5
5     6
6     0
7     1
8     2
9     3
10    4
11    5
12    6
13    0
Name: DateTime, dtype: int64

Month

In [300]:
golf_df['DateTime'].dt.month

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
12    7
13    7
Name: DateTime, dtype: int64

Operaciones

In [301]:
golf_df['DateTime'][0] - golf_df['DateTime'][5]

Timedelta('-5 days +00:00:00')

In [302]:
golf_df['DateTime'] - golf_df['DateTime']

0    0 days
1    0 days
2    0 days
3    0 days
4    0 days
5    0 days
6    0 days
7    0 days
8    0 days
9    0 days
10   0 days
11   0 days
12   0 days
13   0 days
Name: DateTime, dtype: timedelta64[ns]

### 39.- Calcular el último día de la semana con y sin juego

```python
Result
Don't Play    6
Play          6
Name: dayofweek, dtype: int64
```

In [323]:
#Código:
golf_df['dayOfWeek'] = golf_df["DateTime"].dt.dayofweek

golf_df.groupby('Result').max("dayOfWeek")["dayOfWeek"]

Result
Don't Play    6
Play          6
Name: dayOfWeek, dtype: int64

## Cambio de índice

Para configurar una columna existente como índice

In [ ]:
date_df = golf_df.set_index('DateTime')
date_df

In [ ]:
date_df.index

Si el índice es de tipo datetime se puede utilizar `resample` para hacer agregaciones o cortes

In [ ]:
# W de weekly.
date_df.resample('W').mean()

## Escribir Datos

En un archivo csv.

```python 
>>> golf_df.to_csv('new_playgolf.csv', index=False)

>>> !cat new_playgolf.csv 

Date,Outlook,Temperature,Humidity,Windy,Result,TempHumid,HeatIndex,day,DateTime
7/1/14,sunny,85,85,False,Don't Play,170,98.0046312500001,1,2014-07-01
7/2/14,sunny,80,90,True,Don't Play,170,84.47439999999996,2,2014-07-02
7/3/14,overcast,83,78,False,Play,161,89.66991075999985,3,2014-07-03
7/4/14,rain,70,96,False,Play,166,62.84702400000019,4,2014-07-04
7/5/14,rain,68,80,False,Play,148,69.08977600000006,5,2014-07-05
7/6/14,rain,65,70,True,Don't Play,135,73.66802499999999,6,2014-07-06
7/7/14,overcast,64,65,True,Play,129,75.9871160000001,7,2014-07-07
7/8/14,sunny,72,95,False,Don't Play,167,66.2473960000001,8,2014-07-08
7/9/14,sunny,69,70,False,Play,139,72.84364900000003,9,2014-07-09
7/10/14,rain,75,80,False,Play,155,74.55700000000012,10,2014-07-10
7/11/14,sunny,75,70,True,Play,145,75.777625,11,2014-07-11
7/12/14,overcast,72,90,True,Play,162,68.10694399999996,12,2014-07-12
7/13/14,overcast,81,75,False,Play,156,84.52344124999973,13,2014-07-13
7/14/14,rain,71,80,True,Don't Play,151,70.48698400000002,14,2014-07-14
```

## Análisis Exploratorio de los Datos

### 40.- Efectuar un Análisis Exploratorio (EDA)

Abrir el archivo chess_games.csv y responder las siguientes preguntas en cuadros de código separados:

1. ¿Cuántas filas de datos tiene?
2. ¿Qué representa cada fila?
3. ¿Quién ganó más, los blancos o los negros?
4. ¿Cuántas jugadas por partida hay en promedio?
5. ¿Cuál fue la "primera jugada" más probable?
6. ¿Cuántas partidas terminan en jaque mate? (la alternativa es la rendición o el tiempo muerto)
7. ¿Qué porcentaje de partidas es?
8. ¿Cuánto duró la partida media?
9. ¿Cuánto duró la partida media que ganaron las blancas? 
10. ¿Cuánto duró la partida media que fue un empate?
11. ¿Qué es un código de incremento?
12. Haz tres preguntas propias *por escrito*. Luego contéstalas. (escribimos nuestras preguntas porque si vuelves más tarde olvidarás qué pregunta estabas respondiendo)

In [326]:
chess_df = pd.read_csv('C:/Users/NGALAZ/Documents/Repositorios/Review2-Files/chess_games.csv',delimiter=",")

In [328]:
#¿Cuántas filas de datos tiene?
print(chess_df.shape[0])

20058

In [329]:
#¿Qué representa cada fila?
#R.- Representan las partidas jugadas

In [331]:
#¿Quién ganó más, los blancos o los negros?
ganador = ""
if chess_df[chess_df["winner"]=="white"].shape[0] > chess_df[chess_df["winner"]=="black"].shape[0]:
    ganador = "Los negros ganaron más"
else:
    ganador= "Los blancos ganaron más"

ganador

'Los negros ganaron más'

In [333]:
#¿Cuántas jugadas por partida hay en promedio?
print(chess_df["turns"].mean())

60.46599860404826

In [335]:
#¿Cuál fue la "primera jugada" más probable?
print(chess_df["opening_name"].max())

Zukertort Opening: Wade Defense

In [340]:
total_partidas = chess_df.shape[0]
total_partidas = chess_df.shape[0]
partidas_jaque = chess_df[chess_df["victory_status"]=="mate"].shape[0]
partidas_rendicion = chess_df[chess_df["victory_status"]=="resign"].shape[0]
partidas_t_muerto = chess_df[chess_df["victory_status"]=="outoftime"].shape[0]

In [343]:
#¿Cuántas partidas terminan en jaque mate?
print(partidas_jaque)

6325

In [344]:
#¿Qué porcentaje de partidas es?
print(partidas_jaque * 100.0 / total_partidas)

31.533552697178184

In [346]:
#¿Cuánto duró la partida media?
print(chess_df["turns"].mean())

60.46599860404826

In [347]:
#¿Cuánto duró la partida media que ganaron las blancas?
print(chess_df[chess_df["winner"]=="white"]["turns"].mean())

57.79022097790221

In [349]:
#¿Cuánto duró la partida media que fue un empate?
print(chess_df[chess_df["victory_status"]=="draw"]["turns"].mean())

83.78145695364239

In [350]:
#¿Qué es un código de incremento?
#R.-cantidad de tiempo que se agrega al reloj después de cada movimiento

### 41.- Efectuar un análisis exploratorio

Abrir el archivo exo.csv, https://exoplanetarchive.ipac.caltech.edu/docs/API_kepcandidate_columns.html y contestar las siguientes preguntas escribiendo headers, divisiones de celdas e identaciones necesarias

1. ¿cuántas filas de datos tiene?
2. ¿Qué representa cada fila?
3. ¿Cuántos planetas están confirmados?
4. ¿Cuál es la temperatura máxima de los planetas?
5. ¿Cuál es la temperatura máxima de las estrellas?
6. ¿Cuál es la distancia entre el planeta y la estrella?
7. ¿Cuántos planetas hay en cada sistema?
8. ¿Cuánto varía la temperatura de los planetas?
9. ¿Cuánto varían las temperaturas de las estrellas?
10. ¿Cuántos NaN hay en cada categoría?
11. Haz tres preguntas propias *por escrito*. Luego contéstalas. (escribimos nuestras preguntas porque si vuelves más tarde olvidarás qué pregunta estabas respondiendo)

In [353]:
planet_df = pd.read_csv('C:/Users/NGALAZ/Documents/Repositorios/Review2-Files/exo_planet.csv',delimiter=",")

In [357]:
#¿cuántas filas de datos tiene?
planet_df.shape[0]

9564

In [359]:
#¿Qué representa cada fila?
#R.- representan planetas

In [366]:
#¿Cuántos planetas están confirmados?
planet_df[planet_df["koi_disposition"]=="CONFIRMED"].shape[0]

2293

In [371]:
#¿Cuál es la temperatura máxima de los planetas?
print (planet_df["koi_teq"].max(), " Grados Kelvin")

14667.0  Grados Kelvin

In [374]:
#¿Cuál es la temperatura máxima de las estrellas?
print (planet_df["koi_steff"].max()," Grados Kelvin")

15896.0  Grados Kelvin

In [387]:
#¿Cuál es la distancia entre el planeta y la estrella?
planet_df[["koi_impact"]]

      koi_impact
0          0.146
1          0.586
2          0.969
3          1.276
4          0.701
...          ...
9559       0.765
9560       1.252
9561       0.043
9562       0.147
9563       0.134

[9564 rows x 1 columns]

In [396]:
#¿Cuántos planetas hay en cada sistema?
planet_df.groupby("kepid").count()["rowid"]

kepid
757450      1
892772      1
1025986     1
1026032     1
1026957     1
           ..
12833566    1
12834874    1
12835139    1
12885212    2
12935144    1
Name: rowid, Length: 8214, dtype: int64

In [398]:
#¿Cuánto varía la temperatura de los planetas?
planet_df["koi_teq"].std()

856.3511614828553

In [399]:
#¿Cuánto varía la temperatura de los estrellas?
planet_df["koi_steff"].std()

796.857947398336

In [405]:
#¿Cuántos NaN hay en cada categoría?
planet_df.isna().sum()

rowid                   0
kepid                   0
kepoi_name              0
kepler_name          7270
koi_disposition         0
koi_pdisposition        0
koi_score            1510
koi_fpflag_nt           0
koi_fpflag_ss           0
koi_fpflag_co           0
koi_fpflag_ec           0
koi_period              0
koi_period_err1       454
koi_period_err2       454
koi_time0bk             0
koi_time0bk_err1      454
koi_time0bk_err2      454
koi_impact            363
koi_impact_err1       454
koi_impact_err2       454
koi_duration            0
koi_duration_err1     454
koi_duration_err2     454
koi_depth             363
koi_depth_err1        454
koi_depth_err2        454
koi_prad              363
koi_prad_err1         363
koi_prad_err2         363
koi_teq               363
koi_teq_err1         9564
koi_teq_err2         9564
koi_insol             321
koi_insol_err1        321
koi_insol_err2        321
koi_model_snr         363
koi_tce_plnt_num      346
koi_tce_delivname     346
koi_steff             363
koi_steff_err1        468
koi_steff_err2        483
koi_slogg             363
koi_slogg_err1        468
koi_slogg_err2        468
koi_srad              363
koi_srad_err1         468
koi_srad_err2         468
ra                      0
dec                     0
koi_kepmag              1
dtype: int64

## Unión de DataFrames

Es posible unir DataFrames como se haría en SQL.

Ejemplo

In [406]:
mood_df = pd.DataFrame([['overcast', 'sad'], ['rainy', 'sad'], ['sunny', 'happy']],
                       columns=['Weather', 'Mood'])

mood_df

    Weather   Mood
0  overcast    sad
1     rainy    sad
2     sunny  happy

In [407]:
golf_df.merge(mood_df, how='inner', left_on='Outlook', right_on='Weather')

,Date,Outlook,Temperature,Humidity,Windy,Result,TempHumid,HeatIndex,day,DateTime,dayOfWeek,Weather,Mood
0,7/1/14,sunny,85,85,False,Don't Play,170,98.004631,1,2014-07-01,1,sunny,happy
1,7/2/14,sunny,80,90,True,Don't Play,170,84.474400,2,2014-07-02,2,sunny,happy
2,7/8/14,sunny,72,95,False,Don't Play,167,66.247396,8,2014-07-08,1,sunny,happy
3,7/9/14,sunny,69,70,False,Play,139,72.843649,9,2014-07-09,2,sunny,happy
4,7/11/14,sunny,75,70,True,Play,145,75.777625,11,2014-07-11,4,sunny,happy
5,7/3/14,overcast,83,78,False,Play,161,89.669911,3,2014-07-03,3,overcast,sad
6,7/7/14,overcast,64,65,True,Play,129,75.987116,7,2014-07-07,0,overcast,sad
7,7/12/14,overcast,72,90,True,Play,162,68.106944,12,2014-07-12,5,overcast,sad
8,7/13/14,overcast,81,75,False,Play,156,84.523441,13,2014-07-13,6,overcast,sad

## Concatenar

Este método es equivalente a una unión de SQL

In [408]:
df1 = pd.DataFrame(
    {'Col3': range(5), 'Col2': range(5), 'Col1': range(5)},
    index=range(0, 5))
df2 = pd.DataFrame(
    {'Col1': range(5), 'Col2': range(5), 'Col4': range(5)},
    index=range(3, 8))

In [409]:
df1

   Col3  Col2  Col1
0     0     0     0
1     1     1     1
2     2     2     2
3     3     3     3
4     4     4     4

In [410]:
df2

   Col1  Col2  Col4
3     0     0     0
4     1     1     1
5     2     2     2
6     3     3     3
7     4     4     4

#### Vertical
`sort` controla el orden de las columnas

In [ ]:
pd.concat([df1, df2], axis=0, join='outer', sort=True)

`inner` limita las columnas de ambas entradas

In [ ]:
pd.concat([df1, df2], axis=0, join='inner', sort=True)

#### Horizontal

In [ ]:
pd.concat([df1, df2], axis=1)

**Extra:** Por qué algunos números son flotantes y otros no?

Documentación: https://pandas.pydata.org/pandas-docs/stable/merging.html